Revit 2016 API
FabricationService Properties
The FabricationService type exposes the following members.
Properties
Name | Description
FabricationSystemName
 The fabrication system name of the service.
GroupCount
 The number of groups in the service.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The name of the service.
ServiceId
 The service identifier of the service.
See Also
FabricationService Class
Autodesk.Revit.DB Namespace